Конфигурация/Documents/СведенияПредоставляемыеЮрФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СведенияПредоставляемыеЮрФизЛицами</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСведений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСведенийПредоставляемыхЮрФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьДляПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИнвестирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЦеннойБумаги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сделки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСделки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЦеннойБумаги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНКД</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НКД</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СделкиСВалютой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСделки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрвалюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКонтрвалюты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СведенияПредоставляемыеЮрФизЛицами/Ext/ManagerModule.bsl
Функция ПолучитьСоответствиеДвоичныхДанных(Параметры) Экспорт
	
	ДанныеДляВыгрузки = ПолучитьДанныеДляВыгрузки(Параметры);
	Если Не ДанныеДляВыгрузки = Неопределено Тогда
		
		СоответствиеДвоичныхДанных = Новый Соответствие;   
		
		Для каждого СтрокаКлиенты Из ДанныеДляВыгрузки.Клиенты Цикл
			
			ИмяФайла = "BrokerReport_" + Формат(СтрокаКлиенты.ДатаНачала, "ДФ=dd.MM.yy") + "_-_" + Формат(СтрокаКлиенты.ДатаОкончания, "ДФ=dd.MM.yy") + "_";
			
			СтруктураОтбора = Новый Структура("СчетДоверительногоУправления", СтрокаКлиенты.СчетДоверительногоУправления); 
			ОбъектыИнвестирования = ДанныеДляВыгрузки.ОбъектыИнвестирования.НайтиСтроки(СтруктураОтбора);
			Сделки = ДанныеДляВыгрузки.Сделки.НайтиСтроки(СтруктураОтбора);
			
			Если ОбъектыИнвестирования.Количество() + Сделки.Количество() > 0 Тогда
			
				СоответствиеДвоичныхДанных.Вставить(
					ИмяФайла + РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(СтрокаКлиенты.КодСчета), 
					ПолучитьДвоичныеДанные(Параметры, СтрокаКлиенты.Наименование, ОбъектыИнвестирования, Сделки));
				
			КонецЕсли; 
		
		КонецЦикла; 
		
		Возврат СоответствиеДвоичныхДанных;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеДляВыгрузки(Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = ""_ЖурналКонфликтаИнтересов""
		|	И ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет)
		|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Обработка = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки(Выборка.Ссылка);
		Обработка.Период = Параметры.ВыгружаемыйПериод;
		Обработка.Организация = Параметры.Организация;
		Обработка.ВыводитьСделкиРЕПО = Параметры.ВыгружатьСделкиРЕПО;
		Обработка.ТаблицаКлиентов.Загрузить(Параметры.Клиенты);
		Результат = Обработка.ПолучитьДанныеДляВыгрузки(Параметры.ДатаПредоставленияИнформации);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена обработка ""Журнал конфликта интересов""");
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьДвоичныеДанные(Параметры, СчетДоверительногоУправления, ОбъектыИнвестирования, Сделки)

	ПотокДанных = Новый ПотокВПамяти;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.ОткрытьПоток(ПотокДанных);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтчетУправляющего");
	
	ЗаписьXML.ЗаписатьАтрибут("ДатаПредоставленияИнформации", 	Формат(Параметры.ДатаПредоставленияИнформации, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("НачалоПериода", 					Формат(Параметры.ВыгружаемыйПериод.ДатаНачала, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("ОкончаниеПериода",				Формат(Параметры.ВыгружаемыйПериод.ДатаОкончания, "ДФ=yyyyMMdd"));
	ЗаписьXML.ЗаписатьАтрибут("Клиент", 						СчетДоверительногоУправления);
	
	Если ОбъектыИнвестирования.Количество() > 0 Тогда
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("ОбъектыИнвестирования"); 
		
		Для каждого СтрокаОбъектыИнвестирования Из ОбъектыИнвестирования Цикл
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаОбъектыИнвестирования");
			
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.Рынок, 						"Рынок", 						НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.ЦеннаяБумага, 				"ЦеннаяБумага", 				НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.СерияНомер, 					"ИдентификаторЦеннойБумаги", 	НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.Эмитент, 					"ЮрФизЛицо", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоНачальныйОстаток, 	"НачальныйОстаток", 			НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоПриход, 			"Приход", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоРасход, 			"Расход", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаОбъектыИнвестирования.КоличествоКонечныйОстаток, 	"КонечныйОстаток", 				НазначениеТипаXML.Явное);
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаОбъектыИнвестирования
			
		КонецЦикла; 
	
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ОбъектыИнвестирования
	
	КонецЕсли; 
	
	Если Сделки.Количество() > 0 Тогда
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сделки"); 
		
		Для каждого СтрокаСделки Из Сделки Цикл
		
			ЗаписьXML.ЗаписатьНачалоЭлемента("СтрокаСделки");
			
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.ДатаОперации, 	"ДатаСделки", 					НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Операция, 		"ВидСделки", 					НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Рынок, 			"Рынок", 						НазначениеТипаXML.Явное); 
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.ЦеннаяБумага, 	"ЦеннаяБумага", 				НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СерияНомер, 	"ИдентификаторЦеннойБумаги", 	НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Эмитент, 		"ЮрФизЛицо", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Количество, 	"Количество", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Цена, 			"Цена", 						НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.Сумма, 			"СуммаБезНКД", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СуммаКупона, 	"НКД", 							НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СрокРЕПО, 		"СрокРЕПО", 					НазначениеТипаXML.Явное);
			ЗаписатьXML(ЗаписьXML, СтрокаСделки.СтавкаРЕПО, 	"СтавкаРЕПО", 					НазначениеТипаXML.Явное);
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //СтрокаСделки
			
		КонецЦикла; 
	
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сделки
	
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ОтчетУправляющего
	ЗаписьXML.Закрыть();
	
	Возврат ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

Процедура ЗаписатьИнформациюОФайлеВДополнительныеСведения(Ссылка, ПутьКФайлу, ХешСумма) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Объект КАК Объект,
		|	ДополнительныеСведения.Ссылка КАК Свойство,
		|	&ПутьКФайлу КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ПутьКФайлуОтчетаБрокера""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Объект,
		|	ДополнительныеСведения.Ссылка,
		|	&ХешСумма
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Ключ = ""Документ.СведенияПредоставляемыеЮрФизЛицами.ХешСуммаФайла""";
	
	Запрос.УстановитьПараметр("Объект", 	Ссылка);
	Запрос.УстановитьПараметр("ПутьКФайлу", ПутьКФайлу);
	Запрос.УстановитьПараметр("ХешСумма", 	ХешСумма);
		                                                   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();
	
	КонецЦикла;
	
КонецПроцедуры
